OpenFOAM-v2506/tutorials/incompressible/pimpleFoam/RAS/axialTurbine_rotating_oneBlade/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 -1 );

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    GVINLET
    {
        type            fixedValue;
        value           uniform ( 0 0 -1 );
    }

    DTOUTLET
    {
        type            zeroGradient;
        value           $internalField;
    }

    "(.*HUB|GVBLADE|.*SHROUD)"
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    "(RUBLADE.*|RUHUB)"
    {
        type            movingWallVelocity;
        value           uniform ( 0 0 0 );
    }

    "(GVOUTLET|RUINLET|RUOUTLET|DTINLET)"
    {
        type            cyclicAMI;
        value           $internalField;
    }
/*
    "(.*CYCLIC.*)"
    {
        type            cyclicAMI;
        value           $internalField;
    }
*/
}


// ************************************************************************* //
